import { benefitsUa } from "../pages/Education/uaBenef.js";
import { progressImage } from "../pages/Progress/ProgressImage.js";
import { companyImg } from '../pages/Feedback/companyImg.js';
import { clientImg } from "../pages/Feedback/clientImg.js";

export const dataUa = {
  navigation: {
    nav: [
      { href: "#about-us", label: "Про нас", hasArrow: true },
      { href: "#feedback", label: "Відгуки", hasArrow: true },
      { href: "#study-forms", label: "Форми навчання", hasArrow: true },
      { href: "#qa", label: "Q&A", hasArrow: true },
      { href: "#contacts", label: "Контакти", hasArrow: true },
    ],
  },
  banner: {
    title: "Англійська для корпоративних клієнтів",
    main_title: "Розширюйте",
    main_title_middle: "горизонти свого бізнесу",
    main_title_end: "з англійською!",
    explanation_str:
      "Англійська - це не тільки інструмент збільшення конкурентоспроможності та",
    explanation_mid:
      "глобалізації бізнесу, але й інструмент покращення взаємодії персоналу,",
    explanation_end:
      "адже це спільно, проведений час та надбудова ближчих звязків у команді.",
    button: "Дізнатися більше про курси",
  },
  values: {
    title: "Наші цінності",
    subtitle: "Ваша мета",
    subtitle_end: "- наша мотивація",
    points: [
      {
        title: "Справедливість",
        description:
          "Цілковито віддаватися справі, повністю включитися в урок, щоб було відчуття, що цей урок справді був продуктивним.",
      },
      {
        title: "Порядок",
        description:
          "Бути організованим, структура та ясність навчання - одне з основних правил нашого навчання.",
      },
      {
        title: "Працьовитість",
        description:
          "Бути чесним із собою та іншими, не боятися відкрито визнавати, що важко працювати з певним студентом і відмовлятися від співпраці з ним.",
      },
      {
        title: "Креативність",
        description:
          "Бути творчим і інноваційним, не боятися відходити від шаблону, якщо бачиш, що це принесе користь студенту.",
      },
      {
        title: "Вміння",
        description:
          "Постійно практикувати та вдосконалювати свої навички, і повністю реалізувати їх під час навчального процесу.",
      },
    ],
  },
  mission: {
    title: "Наша місія",
    text: "Викладати англійську в кайф для учня, в кайф для себе та пам’ятати, що головне - це допомогти реалізації цілей та мрій наших учнів",
    vision_title: "Наше бачення",
    vision_text:
      "Навчити українців англійської на рівні В2 та вище для того, щоб вони використовували її, як інструмент досягнення своїх цілей у бізнесі та особистих справах",
  },
  team: {
    title: "Познайомтесь з нами",
    subtitle: "Велика команда для",
    subtitle_end: "великих досягнень",
  },
  feedback: {
    title: "Відгуки про нас",
    subtitle: "Відгуки",
    subtitle_main: "про успіхи",
    subtitle_end: "з нами",
    company_feedback: [
      {
        company: "Inoxoft",
        logo: companyImg.inoxoft,
        text: "Щиро дякую за чудову співпрацю з Людмилою, яка є відданим співробітником Inoxoft протягом багатьох років. Людмила постійно надає відмінні навчальні послуги та постійно отримує високу оцінку від співробітників. Вона підтримує інтерес до роботи та високий рівень задоволення. Крім того, Людмила відома своєю доступністю, оперативністю, інноваційними ідеями та вмінням налагоджувати комунікацію. Неможливо уявити професійну співпрацю без її видатного внеску.",
        person: {
          image: companyImg.anastasia,
          name: "Анастасія Добуш",
          position: "Керівник відділу операцій з персоналом",
        },
      },
      {
        company: "Amazinum",
        logo: companyImg.amazinum,
        text: "Ваш курс англійської мови для компанії в сфері data science є чудовим. Включення технічної лексики та реальних прикладів з даних підвищує релевантність для професіоналів у цій галузі. Фокус на чітку і ясну комунікацію в контексті проектів, що базуються на даних, надає слухачам корисні навички для співпраці та подання складних результатів. Цей індивідуальний підхід забезпечує не тільки покращення мовних навичок, але й ефективну передачу складних концепцій у сфері data science.",
        person: {
          image: companyImg.alex,
          name: "Олексій Цебрій",
          position: "Генеральний директор",
        },
      },
      {
        company: "Goodface",
        logo: companyImg.goodface,
        text: "Команда Goodface навчається в школі англійської мови Street English вже близько 9 місяців. Хочемо поділитися нашими враженнями та досвідом взаємодії. Заняття завжди проводяться вчасно, за зручним і гнучким графіком, що дозволяє легко поєднувати навчання з роботою (вставати на пару годин раніше – не проблема). Кожне заняття цікаве та інтерактивне, але найголовніше – корисне. Теми, зосереджені на бізнес-англійській та актуальних соціальних питаннях, дозволяють одразу застосовувати здобуті знання і нову лексику в професійній діяльності. Окремо хочемо відзначити підхід викладача, який завжди готовий підтримати, дати корисні поради та допомогти вирішити будь-які мовні питання, тому школа однозначно заслуговує на нашу перевагу!",
        person: {
          image: companyImg.yana,
          name: "Яна Гринчук",
          position: "COO компанії Goodface",
        },
      },
    ],
    client_feedback: [
      {
        text: "Добрий день, дуже дякую за зв'язок! Мені все дуже подобається! Я маю найкращого викладача, який дуже уважний і завжди чудово готує уроки, допомагає мені там, де це необхідно) За цей час, який я провела з вами, я вже бачу результат, і дуже вдячна за це! Також мала можливість пройти кілька уроків у розмовному клубі, і все на найвищому рівні! Дякую💗🥰",
        person: {
          image: clientImg.mariana,
          name: "Маріана Поповняк",
          status: "Студент",
        },
      },
      {
        text: "Добрий день! Мені дуже подобається навчання, чудовий викладач. Дуже цікаве ставлення до уроків і матеріалу. Все зрозуміло і чітко. Класно, що поєднуються говоріння, читання, письмо та слухання. Мій рівень англійської значно покращився, я почала вільніше спілкуватися англійською, дізналася багато нових слів і значно покращила свою граматику. Дуже дякую!",
        person: {
          image: clientImg.yaryna,
          name: "Ярина",
          status: "Студент",
        },
      },
      {
        text: "Привіт! Дякую, що зробили уроки англійської тим, що я справді насолоджуюсь. Комбінація інтерактивних завдань та персоналізованих відгуків підвищила мою впевненість. Мій викладач – чудовий, завжди підтримує і терплячий. Я відчуваю, що нарешті починаю говорити природно, не думаючи над кожним словом. Розмовний клуб став для мене особливим моментом – я здобув цінні знання і знайшов чудових друзів. Дуже радий бути частиною цього! ✨😊",
        person: {
          image: clientImg.dianne,
          name: "Ден",
          status: "Студент",
        },
      },
      {
        text: "Добрий день! Дякую за вашу турботу! Мені дуже подобаються заняття, які проводила Настя! Я дуже задоволена, бо кожен урок легкий! Дякую 🤩",
        person: {
          image: clientImg.nataliia,
          name: "Наталія Гунка",
          status: "Студент",
        },
      },
      {
        text: "Добрий день! Мені дуже подобається підхід та самі уроки, викладач Таня все дуже легко і чітко пояснює, час на уроці проходить дуже швидко, і найголовніше, я помічаю позитивні результати від навчання.",
        person: {
          image: clientImg.christina,
          name: "Крістіна Гайдан",
          status: "Студент",
        },
      },
      {
        text: "Добрий день, StreetEnglishSchool – найкраща школа англійської мови❤️‍🔥! Я просто в захваті від навчання, я покращив свій рівень англійської в цій школі. Викладач, який мене навчає, дуже добре пояснює всі теми, правила, які мені складно зрозуміти🥰! Не шкодую ані хвилини, що обрав саме цю школу для вивчення англійської 😍",
        person: {
          image: clientImg.vasyl,
          name: "Василь Клюк",
          status: "Студент",
        },
      },
      {
        text: "Добрий день! Мені все дуже подобається🥰, я насправді дуже рада, що Олена – моя викладачка, мені дуже подобаються її цінності, уроки завжди легкі та швидкі, багато цікавих завдань. І вона із задоволенням допомагає з будь-якими питаннями, подає матеріал дуже доступно і справді вміє мотивувати.",
        person: {
          image: clientImg.olenka,
          name: "Оленка Козак",
          status: "Студент",
        },
      },
      {
        text: "Добрий день! Дякую, мені все подобається. Легке спілкування, все дуже зрозуміло. Мені подобається, що ми не переходимо до нових тем, поки не освоїмо 100% попередніх, вона добре мене коригує, коли я роблю помилки, змушує задуматися і проаналізувати їх самостійно. Поки що не маю зауважень до Крісті, задоволена нашою співпрацею🫶🏻",
        person: {
          image: clientImg.kateryna,
          name: "Катерина Василик",
          status: "Студент",
        },
      },
      {
        text: "Доброго дня! Мені дуже подобаються уроки. Підхід дуже продуманий, все пояснюється крок за кроком, що полегшує розуміння навіть найскладніших тем. Мій учитель уважний і завжди стежить за тим, щоб я відчував себе впевнено, перш ніж рухатися далі. Якщо я роблю помилки, вони вирішуються конструктивно, допомагаючи мені аналізувати та уникати їх у майбутньому.",
        person: {
          image: clientImg.eric,
          name: "Ерік",
          status: "Студент",
        },
      },
    ],
    buttons: {
      company: {
        text: "Компанії",
      },
      client: {
        text: "Клієнти",
      },
    },
  },
  phrase: {
    quote: "«Межі моєї мови — це межі мого світу»",
    author: {
      name: "Людвіг Вітгенштейн",
      position: "Філософ",
    },
    main_title: "Розширюйте можливості",
    main_title_str: "своєї",
    main_title_mid: "комунікації, розширюйте можливості",
    main_title_end: "свого світу",
  },
  education: {
    title: "Форма навчання",
    subtitle: "Виберіть свій",
    subtitle_middle: "ідеальний формат",
    subtitle_end: "навчання",
    formats: {
      individual: {
        title: "Індивідуальне онлайн-навчання",
        subtitle:
          "Персоналізовані заняття з викладачем, адаптовані до ваших цілей та рівня мови.",
        details: {
          time: "60 хв",
          person: "1 людина",
          online: "Онлайн",
        },
        price: {
          base: "410.00₴",
          discounts: {
            lesson_1: "10 занять - 410.00₴",
            lesson_2: "16 занять - 400.00₴",
            lesson_3: "32 заняття - 390.00₴",
          },
        },
      },

      couple: {
        title: "Парні заняття",
        subtitle:
          "Персоналізовані заняття з викладачем, адаптовані до ваших цілей та рівня мови.",
        details: {
          time: "60 хв",
          person: "2 людина",
          online: "Онлайн",
        },
        price: {
          base: "315.00₴",
          discounts: {
            lesson_1: "10 занять - 315.00₴",
            lesson_2: "16 занять - 310.00₴",
            lesson_3: "32 заняття - 300.00₴",
          },
        },
      },

      group: {
        title: "Групове навчання з 3-х осіб",
        subtitle:
          "Персоналізовані заняття з викладачем, адаптовані до ваших цілей та рівня мови.",
        details: {
          time: "60 хв",
          person: "3 людини",
          online: "Онлайн",
        },
        price: {
          base: "260.00₴",
          discounts: {
            lesson_1: "16 занять - 260.00₴",
            lesson_2: "32 заняття - 250.00₴",
          },
        },
        //--//--//

        title2: "Групове навчання з 4-х осіб",
        details2: {
          time2: "60 хв",
          person2: "4 людини",
          online2: "Онлайн",
        },
        price2: {
          base2: "215.00₴",
          discounts2: {
            lesson_12: "16 занять - 215.00₴",
            lesson_22: "32 заняття - 210.00₴",
          },
        },
      },

      speaking: {
        title: "Розмовний клуб",
        subtitle:
          "Персоналізовані заняття з викладачем, адаптовані до ваших цілей та рівня мови.",
        details: {
          time: "60 хв",
          person: "Необмежена кількість учасників",
          online: "Онлайн",
        },
        price: {
          base: "230.00₴",
          discounts: {
            lesson_1: "5 занять - 230.00₴",
          },
        },
      },

      corporate: {
        title: "Корпоративне навчання",
        subtitle:
          "Персоналізовані заняття з викладачем, адаптовані до ваших цілей та рівня мови.",
        details: {
          time: "60 хв",
          person: "~",
          online: "Офлайн/Онлайн",
        },
        message: {
          title: "Індивідуально",
          pre: "Напишіть нам в один із месенджерів",
        },
      },
    },
    buttons: {
      individual: {
        text: "Індивідуально",
      },
      couple: {
        text: "Парні",
      },
      group: {
        text: "Групові",
      },
      speaking: {
        text: "Розмовні",
      },
      corporate: {
        text: "Корпоративні",
      },
    },
  },
  progress: {
    main: "Чому обирають нас",
    subtitle: "Ми допомагаємо",
    subtitle_end: "досягати більшого",
    items: [
      {
        imgSrc: progressImage.block,
        alt: "block-img",
        title: "Індивідуалізація програми",
        text: "Наша школа може розробити унікальну навчальну програму, яка буде найбільш оптимальною для вашої компанії, починаючи з нуля. Це забезпечує врахування всіх ваших специфічних потреб і вимог.",
      },
      {
        imgSrc: progressImage.finance,
        alt: "finance-img",
        title: "Фінансова гнучкість",
        text: "Наша школа надає фінансову гнучкість та еластичність у процесі оплати, що дозволяє вибрати найзручніші варіанти оплати за навчання.",
      },
      {
        imgSrc: progressImage.notebook,
        alt: "notebook-img",
        title: "Адаптація програми",
        text: "Ми можемо модифікувати існуючі курси під ваші конкретні запити, вносячи необхідні корективи та зміни для досягнення максимальної ефективності.",
      },
      {
        imgSrc: progressImage.wallet,
        alt: "wallet-img",
        title: "Можливість зміни курсу",
        text: "Ми пропонуємо можливість змінювати або коригувати курс у процесі навчання, що дозволяє максимально адаптувати програму до актуальних потреб вашої компанії.",
      },
      {
        imgSrc: progressImage.quote,
        alt: "quote-img",
        title: "Регулярна звітність та зворотній зв'язок",
        text: "Ми надаємо регулярні звіти та збираємо відгуки щодо успішності студентів, що дозволяє відслідковувати прогрес ваших співробітників і коригувати навчальний процес за необхідності.",
      },
      {
        imgSrc: progressImage.time,
        alt: "time-img",
        title: "Забезпечення безперервності навчання",
        text: "У випадку онлайн-навчання ми гарантуємо заміну викладача під час його відпустки або хвороби. У процесі офлайн-навчання це залежить від локації. Для корпоративних клієнтів навчальний процес не переривається.",
      },
    ],
  },
  partners: {
    title: "Довіра лідерів",
    subtitle: "Неймовірні",
    subtitle_mid: "компанії, які співпрацюють",
    subtitle_end: "з нами:",
  },
  question: {
    title: "Q&A",
    subtitle: "Відповідаємо",
    subtitle_end: "на ваші запитання:",
    questions: [
      {
        question: "Чи можна адаптувати програму навчання під ваш бізнес?",
        answer:
          "Звісно можна, ми розробляємо кастомізовану програму навчання саме під ваш запит та кінцеву ціль. ",
      },
      {
        question:
          "Як визначається рівень володіння англійською у співробітників?",
        answer:
          "Ми проводимо ввідне тестування. Є кілька варіантів його проходження, або через наш чат-бот, або ж на індивідуальних зустрічах.",
      },
      {
        question: "Як ми можемо оцінити прогрес наших співробітників?",
        answer:
          "Ми проводимо тестування, а також періодично надаємо фідбек про прогрес та відвідуваність.",
      },
      {
        question: "Чи є можливість проведення занять онлайн?",
        answer:
          "Так, наша школа спеціалізується на онлайн навчанні та працює у цій сфері з 2017 року. ",
      },
      {
        question: "Яка тривалість курсу та кількість занять?",
        answer:
          "32 уроки - це повна кількість уроків в курсі. Тривалість від 4 до 8 місяців приблизно, все залежить від того, скільки разів на тиждень займається учень та яка продуктивність засвоєння матеріалу.",
      },
      {
        question: "Чи можлива зміна графіка занять у разі необхідності?",
        answer: "Так, звісно ми адаптуємося під графік наших студентів",
      },
      {
        question: "Які матеріали використовуються під час навчання?",
        answer:
          "Ми маємо курси, які є розроблені на 2 платформах: Padlet або Kalyna, на них ми можемо розробити і курси під ваш особистий запит з використанням додаткових джерел за потреби",
      },
      {
        question: "Чи надаєте ви сертифікати після завершення курсу?",
        answer:
          "Так, звісно сертифікат засвідчує що ви пройшли навчання у нашій школі ",
      },
      // {
      //   question: "Як проходить навчальний процес у Street English School?",
      //   answer:
      //     "Навчальний процес у Street English School починається з визначення рівня володіння англійською мовою та аналізу потреб ваших співробітників. Після цього ми розробляємо індивідуальну програму, яка враховує специфіку вашого бізнесу та навчальні цілі. Заняття можуть проводитися у зручному для вас форматі — індивідуально, у групах або онлайн. Наші викладачі використовують сучасні методики та інтерактивні матеріали, щоб зробити навчання ефективним і цікавим. Ми регулярно вимірюємо прогрес, щоб ви могли бачити реальні результати.",
      // },
      // {
      //   question: "Які форми навчання ви пропонуєте?",
      //   answer:
      //     "Індивідуальне, групове, парне, розмовний клуб, корпоративне навчання",
      // },
    ],
  },
  media: {
    title: "Зв'яжіться з нами",
    subtitle: "Розпочніть вашу",
    subtitle_end: "мовну подорож!",
  },
  comunication: {
    title: "Дізнайтеся більше",
    subtitle: "Безкоштовна",
    subtitle_mid: "консультація",
    subtitle_end: "чекає на вас!",
  },
  //--//--//
  telegram: {
    text: "Телеграм-бот для комунікації",
  },
  benefits: {
    text: benefitsUa,
  },
};

